Repository: jiezhengj/WonderfulSunset
Catalog: WonderfulSunset/Sources/Resources/Localization/*.lproj/Localizable.strings
Languages: es, fr, ja, zh_hans

# Countdown_Prefix
source: 距离黄金时刻还有
es: Hora dorada en
fr: Heure dorée dans
ja: 黄金時間まであと
zh_hans: Golden Hour in

# Score_High_Text
source: 今日大概率出现“火烧云”
es: Se espera un atardecer intenso
fr: Coucher de soleil intense prévu
ja: 素晴らしい夕焼けが期待できます
zh_hans: Intense sunset expected today.

# Feedback_Flip_1
source: 低云太多
es: Demasiadas nubes bajas
fr: Trop de nuages bas
ja: 低雲が多すぎる
zh_hans: Too many low clouds

# Feedback_Success
source: 感谢反馈，算法正在学习
es: ¡Gracias! El algoritmo aprende
fr: Merci ! L'algorithme apprend
ja: ありがとうございます。学習中です
zh_hans: Thanks! Algorithm is learning

# Feedback_Perfect
source: 绝美
es: Impresionante
fr: Magnifique
ja: 最高
zh_hans: Stunning

# Feedback_Good
source: 名不虚传
es: Bueno
fr: Bon
ja: 良い
zh_hans: Good

# Feedback_Flipped
source: 并不准
es: Inexacto
fr: Inexact
ja: 不正確
zh_hans: Not Accurate

# LowCloud_Block
source: 低云挡住了阳光
es: Las nubes bajas lo bloquearon
fr: Les nuages bas l'ont bloqué
ja: 低雲が太陽を遮った
zh_hans: Low clouds blocked it

# Haze_Issue
source: 空气太脏/灰蒙蒙
es: Neblina o mala calidad del aire
fr: Brouillard ou mauvaise qualité de l'air
ja: 煙やAQIが悪い
zh_hans: Haze or poor AQI

# No_Color
source: 云太少/没颜色
es: Sin nubes, solo cielo despejado
fr: Pas de nuages, juste un ciel clair
ja: 雲がなく、ただの晴れ空
zh_hans: No clouds, just clear sky

# Time_Error
source: 时间对不上
es: El tiempo no cuadraba
fr: Le timing était faux
ja: タイミングがずれている
zh_hans: The timing was off

# Deep_Dive_Title
source: 深度分析
es: Análisis Profundo
fr: Analyse Approfondie
ja: 詳細分析
zh_hans: Deep Dive

# Cloud_Analysis_Title
source: 云层分析
es: Análisis de Nubes
fr: Analyse des Nuages
ja: 雲分析
zh_hans: Cloud Analysis

# High_Cloud_Title
source: 高云
es: Nubes Altas
fr: Nuages Hauts
ja: 高層雲
zh_hans: High Cloud

# Mid_Cloud_Title
source: 中云
es: Nubes Medias
fr: Nuages Moyens
ja: 中層雲
zh_hans: Mid Cloud

# Low_Cloud_Title
source: 低云
es: Nubes Bajas
fr: Nuages Bas
ja: 低層雲
zh_hans: Low Cloud

# High_Cloud_Description
source: 高层云是彩霞的画布，越高颜色越鲜艳。
es: Las nubes altas son el lienzo del atardecer, cuanto más altas, más vibrantes los colores.
fr: Les nuages haut sont la toile du coucher de soleil, plus ils sont hauts, plus les couleurs sont vibrantes.
ja: 高層雲は夕焼けのキャンバスで、高いほど色が鮮やかになります。
zh_hans: High clouds are the canvas for sunset, the higher the more vibrant the colors.

# Mid_Cloud_Description
source: 中层云可以反射和散射阳光，创造出丰富的色彩层次。
es: Las nubes medias pueden reflejar y dispersar la luz solar, creando capas de color ricas.
fr: Les nuages moyens peuvent refléter et disperser la lumière solaire, créant des couches de couleurs riches.
ja: 中層雲は反射と散乱で豊かな色層を作ります。
zh_hans: Mid-level clouds can reflect and scatter sunlight, creating rich color layers.

# Low_Cloud_Description
source: 低层云过多会遮挡阳光，影响晚霞的观赏效果。
es: Demasiadas nubes bajas pueden bloquear la luz solar, afectando la experiencia de observación.
fr: Trop de nuages bas peuvent bloquer la lumière solaire, affectant l'expérience de visionnage.
ja: 低層雲が多すぎると、夕焼けが遮られます。
zh_hans: Too many low clouds can block sunlight, affecting the viewing experience.

# Special_Phenomena_Title
source: 特殊现象预测
es: Predicción de Fenómenos Especiales
fr: Prédiction de Phénomènes Spéciaux
ja: 特殊現象予測
zh_hans: Special Phenomena Prediction

# Afterglow_Title
source: 反霞
es: Resplandor
fr: Réverbère
ja: 残照
zh_hans: Afterglow

# Tyndall_Title
source: 丁达尔效应
es: Efecto Tyndall
fr: Effet Tyndall
ja: チンドール効果
zh_hans: Tyndall Effect

# Viewing_Direction_Title
source: 观赏方位
es: Dirección de Visualización
fr: Direction de Visualisation
ja: 鑑賞方向
zh_hans: Viewing Direction

# AR_Guide_Button
source: 实景引导
es: Guía AR
fr: Guide AR
ja: ARガイド
zh_hans: AR Guide

# Calendar_Title
source: 追霞日历
es: Calendario de Atardeceres
fr: Calendrier des Couchers de Soleil
ja: 夕焼けカレンダー
zh_hans: Sunset Calendar

# Notification_Permission_Banner
source: 启用通知，不错过任何一次晚霞机会
es: Habilita las notificaciones para no perder ninguna oportunidad de atardecer
fr: Activez les notifications pour ne manquer aucune opportunité de coucher de soleil
ja: 通知を有効にして、夕焼けの機会を逃さない
zh_hans: Enable notifications to not miss any sunset opportunities

# Allow_Button
source: 允许
es: Permitir
fr: Autoriser
ja: 許可
zh_hans: Allow

# Sunset_Time_Label
source: 日落时间
es: Hora del Atardecer
fr: Heure du Coucher de Soleil
ja: 夕焼け時刻
zh_hans: Sunset Time

# Lab_Feedback_Title
source: 实验室 / 反馈
es: Laboratorio / Retroalimentación
fr: Laboratoire / Feedback
ja: ラボ / フィードバック
zh_hans: Lab / Feedback

# Feedback_Question
source: 准吗？
es: ¿Preciso?
fr: Précis ?
ja: 正確ですか？
zh_hans: Accurate?

# Submit_Feedback_Button
source: 提交反馈
es: Enviar Retroalimentación
fr: Soumettre le Feedback
ja: フィードバックを送信
zh_hans: Submit Feedback

# Select_Feedback_Type
source: 请选择反馈类型
es: Por favor, seleccione el tipo de retroalimentación
fr: Veuillez sélectionner le type de feedback
ja: フィードバックの種類を選択してください
zh_hans: Please select feedback type

# Select_Specific_Reason
source: 请选择具体原因
es: Por favor, seleccione la razón específica
fr: Veuillez sélectionner la raison spécifique
ja: 具体的な理由を選択してください
zh_hans: Please select specific reason

# Cannot_Get_Location
source: 无法获取位置信息
es: No se puede obtener información de ubicación
fr: Impossible d'obtenir des informations de localisation
ja: 位置情報を取得できません
zh_hans: Cannot get location information

# Please_Log_In_To_iCloud
source: 请登录 iCloud 以参与社区反馈
es: Inicia sesión en iCloud para participar en la retroalimentación de la comunidad
fr: Connectez-vous à iCloud pour participer au feedback communautaire
ja: コミュニティフィードバックに参加するにはiCloudにログインしてください
zh_hans: Please log in to iCloud to participate in community feedback

# Open_Settings_Button
source: 打开设置
es: Abrir Configuración
fr: Ouvrir les Paramètres
ja: 設定を開く
zh_hans: Open Settings

# Data_Update_Delayed
source: 数据更新延迟，显示为上次预测
es: Actualización de datos retrasada, mostrando la última predicción
fr: Mise à jour des données retardée, affichage de la dernière prédiction
ja: データ更新が遅れています。前回の予測を表示しています
zh_hans: Data update delayed, showing last prediction

# Insufficient_Weather_Data
source: 天气数据不足，无法计算
es: Datos meteorológicos insuficientes
fr: Données météorologiques insuffisantes
ja: 気象データが不足しています
zh_hans: Insufficient weather data for calculation

# Failed_To_Fetch_Weather_Data
source: 获取天气数据失败
es: Error al obtener datos meteorológicos
fr: Échec de la récupération des données météorologiques
ja: 気象データの取得に失敗しました
zh_hans: Failed to fetch weather data

# Location_Error
source: 位置错误
es: Error de ubicación
fr: Erreur de localisation
ja: 位置エラー
zh_hans: Location error

# Location_Access_Denied
source: 位置访问被拒绝，使用默认位置：巴黎
es: Acceso a ubicación denegado. Usando ubicación predeterminada: París
fr: Accès à la localisation refusé. Utilisation de la position par défaut : Paris
ja: 位置アクセスが拒否されました。デフォルトの場所：パリを使用しています
zh_hans: Location access denied. Using default location: Paris

# Golden_Hour_Passed
source: 黄金时刻已过
es: La hora dorada ha pasado
fr: L'heure dorée est passée
ja: ゴールデンアワーは過ぎました
zh_hans: Golden hour has passed

# Calculating
source: 计算中...
es: Calculando...
fr: Calcul en cours...
ja: 計算中...
zh_hans: Calculating...

# Loading_Cloud_Data
source: 加载云层数据...
es: Cargando datos de nubes...
fr: Chargement des données nuageuses...
ja: 雲データを読み込んでいます...
zh_hans: Loading cloud data...

# Loading_Forecast_Data
source: 加载预报数据...
es: Cargando datos de predicción...
fr: Chargement des données de prévision...
ja: 予報データを読み込んでいます...
zh_hans: Loading forecast data...

# Retry_Button
source: 重试
es: Reintentar
fr: Réessayer
ja: 再試行
zh_hans: Retry

# Golden_Hour_Label
source: 黄金时刻
es: Hora Dorada
fr: Heure Dorée
ja: ゴールデンアワー
zh_hans: Golden Hour

# Sunset_Label
source: 日落时刻
es: Atardecer
fr: Coucher de Soleil
ja: 夕焼け
zh_hans: Sunset

# Blue_Hour_Label
source: 魔幻时刻
es: Hora Azul
fr: Heure Bleue
ja: ブルーアワー
zh_hans: Blue Hour

# High_Score_Description
source: 今日大概率出现‘火烧云’，建议准备好相机。
es: Alta probabilidad de 'nubes de fuego' hoy, se recomienda preparar la cámara.
fr: Haute probabilité de "nuages de feu" aujourd'hui, il est recommandé de préparer votre appareil photo.
ja: 今日は「夕焼け雲」が出現する可能性が高く、カメラの準備をお勧めします。
zh_hans: High probability of 'fire clouds', suggest preparing your camera.

# Medium_Score_Description
source: 云层适中，或许会有温柔的粉色邂逅。
es: Nubes moderadas, tal vez un encuentro suave de color rosa.
fr: Nuages modérés, peut-être une rencontre douce en rose.
ja: 雲量が適度で、優しいピンクの出会いがあるかもしれません。
zh_hans: Moderate clouds, maybe a gentle pink encounter.

# Low_Score_Description
source: 天空稍显沉闷，适合在室内静候下一次惊喜。
es: El cielo está un poco apagado, ideal para esperar la próxima sorpresa en interiores.
fr: Le ciel est un peu terne, parfait pour attendre la prochaine surprise à l'intérieur.
ja: 空がやや暗く、室内で次の驚きを待つのに適しています。
zh_hans: The sky is a bit dull, suitable for waiting indoors for the next surprise.
